Revit 2026 API

# ColorSelectionDialogOriginalColor Property

---

The original color.

**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public Color OriginalColor { get; set; }
```
```vb
Public Property OriginalColor As Color
	Get
	Set
```
```cpp
public:
property Color^ OriginalColor {
	Color^ get ();
	void set (Color^ value);
}
```
```fsharp
member OriginalColor : Color with get, set
```

#### Property Value

Color

| Exception | Condition |
| --- | --- |
| ArgumentNullException | When setting this property: A non-optional argument was null |

#### Reference

ColorSelectionDialog Class

Autodesk.Revit.UI Namespace